Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V4X7.svd
        <register>
          <name>HBRSTR</name>
          <displayName>HBRSTR</displayName>
          <description>HB reset register
          (RCC_PHBRSTR)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTDCRST</name>
              <description>LTDC reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>			  
            </field>
            <field>
              <name>PSRAMRST</name>
              <description>PSRAM reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>			  
            </field>		  
            <field>
              <name>I3CRST</name>
              <description>I3C reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>			  
            </field>		  
            <field>
              <name>ARGBRST</name>
              <description>ARGB reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>			  
            </field>		  
            <field>
              <name>USBHS2RST</name>
              <description>USBHS2 reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>		  		  
            <field>
              <name>USBHS1RST</name>
              <description>USBHS1 reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DVPRST</name>
              <description>DVP reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHMACRST</name>
              <description>Ethernet MAC reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>          
          </fields>
        </register>
	<register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>Clock configuration register2
          (RCC_CFGR2)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTDCDIV</name>
              <description>LTDC division factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LTDCSRC</name>
              <description>LTDC clock source selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2SPLLSRC</name>
              <description>I2S PLL clock source selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPLLDIV</name>
              <description>PLL division factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>				
            <field>
              <name>SYSPLL_GATE</name>
              <description>SYSPLL gate enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPLLSRC</name>
              <description>SYSPLL clock source selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>			
            <field>
              <name>I2S2SRC</name>
              <description>I2S2 clock source</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S3SRC</name>
              <description>I2S3 clock source</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		    <field>
              <name>RNGSRC</name>
              <description>TRNG clock source</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>USBHSPLLSRC</name>
              <description>USBHS Multiplication Factor clock source</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>USBHSPLLCLK</name>
              <description>USBHS Peference Clock source </description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
			<field>
              <name>UTMI1ON</name>
              <description>UTMI1 Clock gate enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>UTMI2ON</name>
              <description>UTMI2 Clock gate enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
	<register>
          <name>CFGR3</name>
          <displayName>CFGR3</displayName>
          <description>Clock configuration register3
          (RCC_CFGR3)</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADC_CLKDIV</name>
              <description>Clock division configuration when the ADC clock source selects USBHS_PLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>		
          </fields>
    </register>		
