Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V4X7.svd
      </registers>
    </peripheral>
  
	<peripheral>
        <name>I3C</name>
        <description>Improved inter-integrated circuit</description>
		<groupName>I3C</groupName>
        <baseAddress>0x40024C00</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
		<interrupt>
          <name>I3C_EV</name>
          <description>I3C event interrupt </description>
          <value>49</value>
        </interrupt>
		<interrupt>
          <name>I3C_ER</name>
          <description>I3C error interrupt </description>
          <value>50</value>
        </interrupt>
		<interrupt>
          <name>I3CWakeUP</name>
          <description>I3C wakeup interrupt </description>
          <value>96</value>
        </interrupt>
        <registers>
          <register>
            <name>I3C_CTLR</name>
            <displayName>I3C_CTLR</displayName>
            <description>I3C control register </description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DCNT</name>
                <description>count of data to transfer during a read or write message,
				in bytes (whatever I3C is acting as master)
				Linear encoding up to 64 Kbytes -1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RNW</name>
                <description>read / non-write message (when I3C is acting as master)</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>ADD</name>
                <description>7-bit I3C dynamic / I2C static slave address (when I3C is acting as master)</description>
                <bitOffset>17</bitOffset>
                <bitWidth>7</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MTYPE</name>
                <description>message type</description>
                <bitOffset>27</bitOffset>
                <bitWidth>4</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MEND</name>
                <description>message end type</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
		  <register>
            <name>I3C_CTLR_ALTERNATE</name>
            <displayName>I3C_CTLR_ALTERNATE</displayName>
            <description>I3C message control register alternate</description>
		    <alternateRegister>I3C_CTLR</alternateRegister>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
			  <field>
                <name>DCNT</name>
                <description>count of data to transfer during a read or write message, in bytes 
				Linear encoding up to 64 Kbytes -1....</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CCC</name>
                <description>8-bit CCC code</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MTYPE</name>
                <description>message type (when I3C is acting as master)</description>
                <bitOffset>27</bitOffset>
                <bitWidth>4</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MEND</name>
                <description>message end type (when I3C is acting as master)</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
			</fields>
          </register>
          <register>
            <name>I3C_CFGR</name>
            <displayName>I3C_CFGR</displayName>
            <description>I3C configuration register </description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000040</resetValue>
            <fields>
              <field>
                <name>EN</name>
                <description>I3C enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CRINIT</name>
                <description>initial master/slave role</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>NOARBH</name>
                <description>no arbitrable header after a START</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RSTPTRN</name>
                <description>HDR reset pattern enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXITPTRN</name>
                <description>HDR Exit Pattern enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PULLUP_EN</name>
                <description>SDA pull-up enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>			  
              <field>
                <name>HJACK</name>
                <description>Hot Join request acknowledge</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXDMAEN</name>
                <description>RX-FIFO DMA request enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXFLUSH</name>
                <description>RX-FIFO flush ,This bit can only be written.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RXTHRES</name>
                <description>RX-FIFO threshold</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXDMAEN</name>
                <description>TX-FIFO DMA request enable</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXFLUSH</name>
                <description>TX-FIFO flush</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>TXTHRES</name>
                <description>TX-FIFO threshold</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TMODE</name>
                <description>transmit mode</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CDMAEN</name>
                <description>C-FIFO DMA request enable</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CFLUSH</name>
                <description>C-FIFO flush</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>TSFSET</name>
                <description>frame transfer set (a.k.a. software trigger)</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_RDR</name>
            <displayName>I3C_RDR</displayName>
            <description>I3C receive data byte register </description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RDB0</name>
                <description>8-bit received data on I3C bus.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_TDR</name>
            <displayName>I3C_TDR</displayName>
            <description>I3C transmit data byte register </description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TDB0</name>
                <description>8-bit data to transmit on I3C bus.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_IBIDR</name>
            <displayName>I3C_IBIDR</displayName>
            <description>I3C IBI payload data register </description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>IBIDB0</name>
                <description>8-bit IBI payload data (earliest byte on I3C bus, i.e. MDB[7:0] mandatory data byte).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIDB1</name>
                <description>8-bit IBI payload data (next byte on I3C bus after IBIDB0[7:0]).</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIDB2</name>
                <description>8-bit IBI payload data (next byte on I3C bus after IBIDB1[7:0]).</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIDB3</name>
                <description>8-bit IBI payload data (latest byte on I3C bus).</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_RESET</name>
            <displayName>I3C_RESET</displayName>
            <description>I3C reset register </description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <resetValue>0x03000000</resetValue>
            <fields>
              <field>
                <name>HST_SIE_RST</name>
                <description>Reset Register of the Master</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>		  	  
            </fields>
          </register>		  	  
          <register>
            <name>I3C_STATR</name>
            <displayName>I3C_STATR</displayName>
            <description>I3C status register </description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>XDCNT</name>
                <description>data counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ABT</name>
                <description>a private read message is completed/aborted prematurely by the slave</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DIR</name>
                <description>message direction</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>MID</name>
                <description>message identifier/counter of a given frame</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_STATER</name>
            <displayName>I3C_STATER</displayName>
            <description>I3C status error register </description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CODERR</name>
                <description>protocol error code/type</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>PERR</name>
                <description>protocol error</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DOVR</name>
                <description>RX-FIFO overrun or TX-FIFO underrun</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>COVR</name>
                <description>C-FIFO underrun or S-FIFO overrun</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ANACK</name>
                <description>address not acknowledged (when the I3C is configured as master)</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DNACK</name>
                <description>data not acknowledged</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DERR</name>
                <description>data error</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_RMR</name>
            <displayName>I3C_RMR</displayName>
            <description>I3C received message register </description>
            <addressOffset>0x40</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>IBIRDCNT</name>
                <description>IBI received payload data count (when the I3C is configured as master)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RCODE</name>
                <description>received CCC code</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RADD</name>
                <description>received slave address (when the I3C is configured as master)</description>
                <bitOffset>17</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_EVR</name>
            <displayName>I3C_EVR</displayName>
            <description>I3C event register </description>
            <addressOffset>0x50</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000003</resetValue>
            <fields>
              <field>
                <name>CFEF</name>
                <description>C-FIFO empty flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXFEF</name>
                <description>TX-FIFO empty flag</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CFNFF</name>
                <description>C-FIFO not full flag</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXFNFF</name>
                <description>TX-FIFO not full flag</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXFNEF</name>
                <description>RX-FIFO not empty flag</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXLASTF</name>
                <description>last written data byte/word flag</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXLASTF</name>
                <description>last read data byte/word flag</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>FCF</name>
                <description>frame complete flag</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXTGTENDF</name>
                <description>slave-initiated read end flag</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRF</name>
                <description>flag</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIF</name>
                <description>IBI flag</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HJF</name>
                <description>hot-join flag</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
