Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V4X7.svd
          <register>
            <name>I3C_INTENR</name>
            <displayName>I3C_INTENR</displayName>
            <description>I3C interrupt enable register </description>
            <addressOffset>0x54</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CFNFIE</name>
                <description>C-FIFO not full interrupt enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXFNFIE</name>
                <description>TX-FIFO not full interrupt enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXFNEIE</name>
                <description>RX-FIFO not empty interrupt enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>FCIE</name>
                <description>frame complete interrupt enable</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXTGTENDIE</name>
                <description>slave-initiated read end interrupt enable</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ERRIE</name>
                <description>error interrupt enable (whatever the I3C is acting as master)</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IBIIE</name>
                <description>IBI request interrupt enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HJIE</name>
                <description>hot-join interrupt enable</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_CEVR</name>
            <displayName>I3C_CEVR</displayName>
            <description>I3C clear event register </description>
            <addressOffset>0x58</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CFCF</name>
                <description>clear frame complete flag</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CRXTGTENDF</name>
                <description>clear slave-initiated read end flag</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CERRF</name>
                <description>clear error flag</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CIBIF</name>
                <description>clear IBI request flag</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CHJF</name>
                <description>clear hot-join flag</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_DEVR0</name>
            <displayName>I3C_DEVR0</displayName>
            <description>I3C own device characteristics register </description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DAVAL</name>
                <description>dynamic address is valid (when the I3C is acting as slave)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DA</name>
                <description>7-bit dynamic address</description>
                <bitOffset>1</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_DEVR1</name>
            <displayName>I3C_DEVR1</displayName>
            <description>I3C device 1 characteristics register</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DA</name>
                <description>assigned I3C dynamic address to slave x</description>
                <bitOffset>1</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIACK</name>
                <description>IBI request acknowledge</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIDEN</name>
                <description>IBI data enable</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SUSP</name>
                <description>suspend/stop I3C transfer on received IBI</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS</name>
                <description>DA[6:0] write disabled</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_DEVR2</name>
            <displayName>I3C_DEVR2</displayName>
            <description>I3C device 2 characteristics register</description>
            <addressOffset>0x68</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DA</name>
                <description>assigned I3C dynamic address to slave x</description>
                <bitOffset>1</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIACK</name>
                <description>IBI request acknowledge</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIDEN</name>
                <description>IBI data enable</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SUSP</name>
                <description>suspend/stop I3C transfer on received IBI</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS</name>
                <description>DA[6:0] write disabled</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_DEVR3</name>
            <displayName>I3C_DEVR3</displayName>
            <description>I3C device 3 characteristics register</description>
            <addressOffset>0x6c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DA</name>
                <description>assigned I3C dynamic address to slave x</description>
                <bitOffset>1</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CRACK</name>
                <description>master-role request acknowledge</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIDEN</name>
                <description>IBI data enable</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SUSP</name>
                <description>suspend/stop I3C transfer on received IBI</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS</name>
                <description>DA[6:0] write disabled</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_DEVR4</name>
            <displayName>I3C_DEVR4</displayName>
            <description>I3C device 4 characteristics register</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DA</name>
                <description>assigned I3C dynamic address to slave x</description>
                <bitOffset>1</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CRACK</name>
                <description>master-role request acknowledge</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBIDEN</name>
                <description>IBI data enable</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SUSP</name>
                <description>suspend/stop I3C transfer on received IBI</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIS</name>
                <description>DA[6:0] write disabled</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_TIMINGR0</name>
            <displayName>I3C_TIMINGR0</displayName>
            <description>I3C timing register 0 </description>
            <addressOffset>0xA0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SCLL_PP</name>
                <description>SCL low duration in I3C push-pull phases, in number of kernel clocks cycles</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLH_I3C</name>
                <description>SCL high duration, used for I3C messages (both in push-pull and open-drain phases), in number of kernel clocks cycles</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLL_OD</name>
                <description>SCL low duration in open-drain phases, used for legacy I2C commands and for I3C open-drain phases (address header phase following a START, not a Repeated START), in number of kernel clocks cycles</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLH_I2C</name>
                <description>SCL high duration, used for legacy I2C commands, in number of kernel clocks cycles</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_TIMINGR1</name>
            <displayName>I3C_TIMINGR1</displayName>
            <description>I3C timing register 1 </description>
            <addressOffset>0xA4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AVAL</name>
                <description>number of kernel clock cycles, that is used whatever I3C is acting as controller or slave, to set the following MIPI I3C timings, like bus available condition time:
When the I3C is acting as slave</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ASNCR</name>
                <description>activity state of the new master (when I3C is acting as active- master)</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FREE</name>
                <description>number of kernel clocks cycles that is used to set some MIPI timings like bus free condition time</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SDA_HD</name>
                <description>SDA hold time, in number of kernel clocks cycles (refer to MIPI timing SDA hold time in push-pull tHD_PP):</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_TIMINGR2</name>
            <displayName>I3C_TIMINGR2</displayName>
            <description>I3C timing register 2 </description>
            <addressOffset>0xa8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>STALLT</name>
                <description>master clock stall on T-bit phase of Data enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STALLD</name>
                <description>master clock stall on PAR phase of Data enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STALLC</name>
                <description>master clock stall on PAR phase of CCC enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STALLA</name>
                <description>master clock stall enable on ACK phase</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STALL</name>
                <description>master clock stall time, in number of kernel clock cycles</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>I3C_GETMDSR</name>
            <displayName>I3C_GETMDSR</displayName>
            <description>I3C get capability register </description>
            <addressOffset>0xD0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TSCO</name>
                <description>clock-to-data turnaround time (tSCO)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
