Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V4X7.svd
				<register>
					<name>R8_UEP3_TX_CTRL</name>
					<description>endpoint 3 send control register</description>
					<addressOffset>0xAA</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 3 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 3 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 3 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 3 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP3_RX_CTRL</name>
					<description>endpoint 3 receive control</description>
					<addressOffset>0xAB</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 3 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 3 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 3 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 3 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 3 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP4_T_LEN</name>
					<description>endpoint 4 send the length register</description>
					<addressOffset>0xAC</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP4_T_LEN</name>
							<description> endpoint 4 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UEP4_TX_CTRL</name>
					<description>endpoint 4 send control register</description>
					<addressOffset>0xAE</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 4 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 4 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 4 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 4 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP4_RX_CTRL</name>
					<description>endpoint 4 receive control</description>
					<addressOffset>0xAF</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 4 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 4 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 4 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 4 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 4 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP5_T_LEN</name>
					<description>endpoint 5 send the length register</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP5_T_LEN</name>
							<description> endpoint 5 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP5_TX_CTRL</name>
					<description>endpoint 5 send control register</description>
					<addressOffset>0xB2</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 5 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 5 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 5 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 5 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP5_RX_CTRL</name>
					<description>endpoint 5 receive control</description>
					<addressOffset>0xB3</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 5 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 5 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 5 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 5 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 5 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP6_T_LEN</name>
					<description>endpoint 6 send the length register</description>
					<addressOffset>0xB4</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP6_T_LEN</name>
							<description> endpoint 6 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP6_TX_CTRL</name>
					<description>endpoint 6 send control register</description>
					<addressOffset>0xB6</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 6 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 6 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 6 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 6 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP6_RX_CTRL</name>
					<description>endpoint 6 receive control</description>
					<addressOffset>0xB7</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 6 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 6 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 6 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 6 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 6 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP7_T_LEN</name>
					<description>endpoint 7 send the length register</description>
					<addressOffset>0xB8</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>UEP7_T_LEN</name>
							<description> endpoint 7 send the length</description>
							<bitRange>[15:0]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP7_TX_CTRL</name>
					<description>endpoint 7 send control register</description>
					<addressOffset>0xBA</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_T_RES_MASK</name>
							<description> endpoint 7 control of the send response to IN transactions</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_TOG_MASK</name>
							<description> endpoint 7 synchronous trigger bit for the sender to
								prepare</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_NAK_ACT</name>
							<description>endpoint 7 sends the end flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_T_DONE</name>
							<description>endpoint 7 sends the end of NAK flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UEP7_RX_CTRL</name>
					<description>endpoint 7 receive control</description>
					<addressOffset>0xBB</addressOffset>
					<size>0x08</size>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UEP_R_RES_MASK</name>
							<description>endpoint 7 has control over the received response</description>
							<bitRange>[1:0]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MASK</name>
							<description>the reception of endpoint 7 expects a synchronous trigger
								bit</description>
							<bitRange>[3:2]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_TOG_MATCH</name>
							<description>received synchronization trigger bit matches the desired
								synchronization trigger bit state</description>
							<bitRange>[4:4]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_TOG</name>
							<description>endpoint 7 for the received return NAK,packet type</description>
							<bitRange>[5:5]</bitRange>
							<access>read-only</access>
						</field>
						<field>
							<name>RB_UEP_R_NAK_ACT</name>
							<description>endpoint 7 receives the end of NAK flag</description>
							<bitRange>[6:6]</bitRange>
							<access>read-write</access>
						</field>
						<field>
							<name>RB_UEP_R_DONE</name>
							<description>endpoint 7 receives the end flag</description>
							<bitRange>[7:7]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP_T_ISO</name>
					<description>usb endpoint sends a synchronous mode enable register</description>
					<addressOffset>0xBC</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>					
						<field>
							<name>RB_UEPn_T_ISO_EN</name>
							<description>upload endpoint(IN) synchronization mode enabled</description>
							<bitRange>[7:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>

				<register>
					<name>R16_UEP_R_ISO</name>
					<description>usb endpoint receives a synchronous mode enable register</description>
					<addressOffset>0xBE</addressOffset>
					<size>0x10</size>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RB_UEPn_R_ISO_EN</name>
							<description>down endpoint(OUT) synchronization mode enabled</description>
							<bitRange>[7:1]</bitRange>
							<access>read-write</access>
						</field>
					</fields>
				</register>				

				<register>
					<name>R8_UH_CFG</name>
					<description>USB host Configuration register</description>
					<addressOffset>0x100</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x07</resetValue>
					<fields>
						<field>
							<name>RB_UH_RST_LINK</name>
							<description>USB connection controller module resets</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RB_UH_RST_SIE</name>
							<description>USB protocol processor reset</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RB_UH_CLR_ALL</name>
							<description>clear all interrupt flags</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UH_PHY_SUSPENDM</name>
							<description>PHY suspend,close utmi clock</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UH_DMA_EN</name>
							<description>DMA transfer enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UH_SOF_EN</name>
							<description>sof packet sending function enabled</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_UH_FORCE_FS</name>
							<description>forced full speed FS</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_UH_LPM_EN</name>
							<description>LPM enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_INT_EN</name>
					<description>USB host interrupt enable register</description>
					<addressOffset>0x102</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UHIE_WKUP_ACT</name>
							<description>Wakeup interrupt enabled</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_RESUME_ACT</name>
							<description>bus recovery interrupt was enabled</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_TRANSFER</name>
							<description>USB transfer end interrupt enabled</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_SOF_ACT</name>
							<description>sof packet sending interruption is enabled</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_TX_HALT</name>
							<description>send pause interrupt enable</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RB_UHIE_FIFO_OVER</name>
							<description>FIFO overflow interrupt enable</description>
							<bitRange>[7:7]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R8_UH_DEV_AD</name>
					<description>USB host device address register</description>
					<addressOffset>0x103</addressOffset>
					<size>0x08</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>RB_UH_DEV_ADDR</name>
							<description>device address</description>
							<bitRange>[7:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>R32_UH_CONTROL</name>
					<description>USB host control register</description>
					<addressOffset>0x104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RB_UH_RX_NO_RES</name>
							<description>IN-DATA no answer,used for synchronous transfer or
								high-speed SPLIT packets</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>RB_UH_TX_NO_RES</name>
							<description>OUT or SETUP DATA no reply is extended and is used for
								synchronous transmission or hign-speed SPLIT packets</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>RB_UH_RX_NO_DATA</name>
							<description>DATA packets are not expected after IN token packets and
								are used for
								high-speed SPLIT packets</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>RB_UH_TX_NO_DATA</name>
							<description>OUT or SETUP token packet packets are followed by no data
								packets for hign-speed SPLIT packets</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>RB_UH_PRE_PID_EN</name>
							<description>this bit is enabled when the port is operating at full
								speed and needs to send low speed packets(PRE)</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>RB_UH_SPLIT_VALID</name>
							<description>valid to send SPLIT packet</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>RB_UH_LPM_VALID</name>
							<description>valid to send LMP packet</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>RB_UH_HOST_ACTION</name>
							<description>host enables the transaction</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>RB_UH_BUF_MODE</name>
							<description>DATA cache control bit</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RB_UH_T_TOG_MASK</name>
							<description>send data PID</description>
							<bitRange>[9:8]</bitRange>
						</field>
						<field>
							<name>RB_UH_T_ENDP_MASK</name>
							<description>transaction token packet endpoint number</description>
							<bitRange>[7:4]</bitRange>
						</field>
						<field>
							<name>RB_UH_T_TOKEN_MASK</name>
							<description>transaction token packet PID</description>
							<bitRange>[3:0]</bitRange>
						</field>
					</fields>
				</register>
