Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V4X7.svd
        <register>
          <name>MACA3LR</name>
          <displayName>MACA3LR</displayName>
          <description>Ethernet MAC address 3 low
          register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MBCA3L</name>
              <description>MAC address3 low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
		
        <register>
          <name>PHY_CR</name>
          <displayName>PHY_CR</displayName>
          <description>PHY configure register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000001</resetValue>
          <fields>
            <field>
              <name>PHY_RSTN</name>
              <description>Ethernet PHY global reset signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>PHY_PD</name>
              <description>PHY power-down mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>						
            <field>
              <name>DUPlEX</name>
              <description>connection mode selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>PHYADDR_EN</name>
              <description>configure the address of the PHY</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>REPHYADDR</name>
              <description>When bit7 is set to 1,bit4 to 0 serve as the address of the PHY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
	
	<peripheral>
      <name>ETHERNET_MMC</name>
      <description>Ethernet: MAC management counters</description>
      <groupName>ETHERNET</groupName>
      <baseAddress>0x40406100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MMCCR</name>
          <displayName>MMCCR</displayName>
          <description>Ethernet MMC control register
          (ETH_MMCCR)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CR</name>
              <description>Counter reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSR</name>
              <description>Counter stop rollover</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROR</name>
              <description>Reset on read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCF</name>
              <description>MMC counter freeze</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRIR</name>
          <displayName>MMCRIR</displayName>
          <description>Ethernet MMC receive interrupt register
          (ETH_MMCRIR)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFCES</name>
              <description>Received frames CRC error
              status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RGUFS</name>
              <description>Received Good Unicast Frames
              Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTIR</name>
          <displayName>MMCTIR</displayName>
          <description>Ethernet MMC transmit interrupt register
          (ETH_MMCTIR)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFS</name>
              <description>Transmitted good frames
              status</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TGFMSCS</name>
              <description>Transmitted good frames
              status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>		
            <field>
              <name>TGFSGS</name>
              <description>Transmitted good frames
              status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
          </fields>
        </register>
		
        <register>
          <name>MMCRIMR</name>
          <displayName>MMCRIMR</displayName>
          <description>Ethernet MMC receive interrupt mask register
          (ETH_MMCRIMR)</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFCEM</name>
              <description>Received frame CRC error
              mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFAEM</name>
              <description>Received more than half of the unaligned error
              frame interrupt masking bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>RGUFM</name>
              <description>Received good unicast frames
              mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTIMR</name>
          <displayName>MMCTIMR</displayName>
          <description>Ethernet MMC transmit interrupt mask
          register (ETH_MMCTIMR)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFM</name>
              <description>Transmitted good frames
              mask</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TGFMSCM</name>
              <description>send multiple conflict flags for good frames
              </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>TGFSCM</name>
              <description>send a single conflict flags for a good frames</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
          </fields>
        </register>
        <register>
          <name>MMCTGFSCCR</name>
          <displayName>MMCTGFSCCR</displayName>
          <description>Ethernet MMC transmitted good frames after a
          single collision counter</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFSCCR</name>
              <description>Transmitted good frames after a single
              collision counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFMSCCR</name>
          <displayName>MMCTGFMSCCR</displayName>
          <description>Ethernet MMC transmitted good frames after
          more than a single collision</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFMSCCR</name>
              <description>Transmitted good frames after more than
              a single collision counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCTGFCR</name>
          <displayName>MMCTGFCR</displayName>
          <description>Ethernet MMC transmitted good frames counter
          register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TGFC</name>
              <description>Transmitted good frames
              counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRFCECR</name>
          <displayName>MMCRFCECR</displayName>
          <description>Ethernet MMC received frames with CRC error
          counter register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFCFCR</name>
              <description>Received frames with CRC error
              counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MMCRFAECR</name>
          <displayName>MMCRFAECR</displayName>
          <description>Ethernet MMC received frames with alignment
          error counter register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFAECR</name>
              <description>Received frames with alignment error
              counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
		
        <register>
          <name>MMCRAFCR</name>
          <displayName>MMCRAFCR</displayName>
          <description>Ethernet MMC received frames counter register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAFCR</name>
              <description>the number of all frames Received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>		
		
        <register>
          <name>STATE</name>
          <displayName>STATE</displayName>
          <description>Ethernet state machine register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ETX_STATE</name>
              <description>Ethernet Receiving state machine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ERX_STATE</name>
              <description>Ethernet sending state machine</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>			
          </fields>
        </register>		
		
        <register>
          <name>MMCRGUFCR</name>
          <displayName>MMCRGUFCR</displayName>
          <description>MMC received good unicast frames counter
          register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RGUFC</name>
              <description>Received good unicast frames
              counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
