Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V4X7.svd
      </registers>
    </peripheral>
	
	<peripheral>
      <name>ARGB</name>
      <description>ARGB</description>
      <groupName>ARGB</groupName>
      <baseAddress>0x40025000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ARGB</name>
        <description>ARGB global interrupts</description>
        <value>97</value>
      </interrupt>	  
      <registers>
        <register>
          <name>CTLR</name>
          <displayName>CTLR</displayName>
          <description>ARGB Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXEIE</name>
              <description>Send buffer empty interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALFIE</name>
              <description>Data Brush Sends More Than Half Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BYTEIE</name>
              <description>Byte send completion interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>TCIE</name>
              <description>Send completion interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>RSTIE</name>
              <description>RESET code sending is interrupted</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>FRHIE</name>
              <description>Data refresh cycle end interrupt enabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>LSB</name>
              <description>Data Send Mode Enabling Bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>MODE</name>
              <description>Send mode configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>DMAEN</name>
              <description>DMA Enables</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>TE</name>
              <description>Send Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>						
          </fields>
        </register>
        <register>
          <name>DAT_ARR</name>
          <displayName>DAT_ARR</displayName>
          <description>ARGB 0/1 Code Period Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <fields>
            <field>
              <name>DAT_ARR</name>
              <description>0/1 yard cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_ARR</name>
          <displayName>RST_ARR</displayName>
          <description>ARGB RESET Code Width Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0001FFFF</resetValue>
          <fields>
            <field>
              <name>RST_ARR</name>
              <description>0/1 yard cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCRL</name>
          <displayName>CCRL</displayName>
          <description>High Level T0H Width Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRL</name>
              <description>0 yard high level T0H width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCRH</name>
          <displayName>CCRH</displayName>
          <description>1-yard high-level T1H width configuration register for ARGB</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CCRH</name>
              <description>1 yard high level T1H width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAT_CYC</name>
          <displayName>DAT_CYC</displayName>
          <description>ARGB Data Refresh Cycle Length Configuration Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DAT_CYC</name>
              <description>ARGB data refresh cycle length in bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAR</name>
          <displayName>DATAR</displayName>
          <description>ARGB Data Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>ARGB sends data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATR</name>
          <displayName>STATR</displayName>
          <description>ARGB State Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>FRHIF</name>
              <description>The data refresh cycle has been sent to the interrupt signal, and 1 is written to clear it</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTIF</name>
              <description>RESET code sends the interrupt mark, writes 1 to clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>Send the interrupt sign completed, write 1 to clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BYTEIF</name>
              <description>The byte sending completion interrupt mark, write 1 to clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALFIF</name>
              <description>Send more than half of the interrupt flag, write 1 to clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEIF</name>
              <description>Send a buffer empty interrupt flag, writing DATAR will clear the subflag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT_CNT</name>
              <description>Send bit counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BYTE_CNT</name>
              <description>Send byte counters</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTR</name>
          <displayName>CNTR</displayName>
          <description>ARGB Counter Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>ARGB base counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
