Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V4X7.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>PSRAM</name>
      <description>PSRAM</description>
      <groupName>PSRAM</groupName>
      <baseAddress>0x40024400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PSRAM</name>
        <description>PSRAM global interrupt</description>
        <value>80</value>
      </interrupt>
      <registers>
        <register>
          <name>CTLR</name>
          <displayName>CTLR</displayName>
          <description>PSRAM control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000300</resetValue>
          <fields>
            <field>
              <name>CFIFO</name>
              <description>Empty Read FIFO Method Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFIFO</name>
              <description>DMA write operation for clearing FIFO mode Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>			
            <field>
              <name>CAP_CFG</name>
              <description>PSRAM capacity configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXIT_LPMD</name>
              <description>PSRAM exits the current low-power state enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING</name>
          <displayName>TIMING</displayName>
          <description>PSRAM time series register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x070C0014</resetValue>
          <fields>
            <field>
              <name>TRC</name>
              <description>Minimum time for read/write cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCPH</name>
              <description>The minimum interval between two consecutive bursts</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLPD</name>
              <description>Sustained pulse width when exiting low power CE_n</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <displayName>DATA</displayName>
          <description>PSRAM DATA Register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x10</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RW_HDATA</name>
              <description>High-byte data written or read</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RW_LDATA</name>
              <description>Low-byte data written or read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>		
        <register>
          <name>ADDR</name>
          <displayName>ADDR</displayName>
          <description>PSRAM Address Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MR_ADDR0</name>
              <description>The register 0 address to be manipulated</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Commands executed</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MW</name>
              <description>Inform PSRAM the nest operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>BUSY</name>
              <description>BUSY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>			
        <register>
          <name>CMD0_CFG</name>
          <displayName>CMD0_CFG</displayName>
          <description>PSRAM Command Word 0 Configuration Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0xA0208000</resetValue>
          <fields>
            <field>
              <name>SW_LB</name>
              <description>Configurable synchronous write (linear burst) commands</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_LB</name>
              <description>Configurable synchronous read (linear burst) commands</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW</name>
              <description>Configurable synchronous write commands</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>SR</name>
              <description>Configurable synchronous read commands</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>			
        <register>
          <name>CMD1_CFG</name>
          <displayName>CMD1_CFG</displayName>
          <description>PSRAM Command Word 1 Configuration Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0xB0FFC040</resetValue>
          <fields>
            <field>
              <name>REFRESH</name>
              <description>Configurable refresh command command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLRST</name>
              <description>Configurable global reset commands</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MREGW</name>
              <description>Configurable register write commands</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>MREGR</name>
              <description>Configurable register read commands</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>		
		
        <register>
          <name>DMACR</name>
          <displayName>DMACR</displayName>
          <description>PSRAM DMA Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TOWBL_TOUT</name>
              <description>Pause time between bursts, in HCLK</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_ONEBL</name>
              <description>DMA burst length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEMORY_SIZE</name>
              <description>Memory Data Width</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>			
            <field>
              <name>DAT_DIR</name>
              <description>Data transmission direction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>			
          </fields>
        </register>			
		
        <register>
          <name>DATA_NUM</name>
          <displayName>DATA_NUM</displayName>
          <description>PSRAM Data Transmission Quantity Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA_NUM</name>
              <description>Number of data transfers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>		
          </fields>
        </register>			

        <register>
          <name>DMA_MEM_ADDR</name>
          <displayName>DMA_MEM_ADDR</displayName>
          <description>Start address register of memory during DMA transmission</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_MEM_ADDR</name>
              <description>The start address of the memory (single-byte alignment) when DMA is in transit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>		
          </fields>
        </register>					
		
        <register>
          <name>DMA_PSRAM_ADDR</name>
          <displayName>DMA_PSRAM_ADDR</displayName>
          <description>Start Address Register of PSRAM during DMA Transmission</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_PSRAM_ADDR</name>
              <description>The start address of the PSRAM when DMA is transmitted (32 bytes aligned in 4 mode and 16 bytes aligned in 2 mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>		
          </fields>
        </register>	
		
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>PSRAM Interrupt State Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AEIF</name>
              <description>Address error interrupt flag, address exceeds MEM capacity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CENEIF</name>
              <description>CEM Error Interrupt Flag, write 1 to clear zero</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMATF</name>
              <description>DMA bus transmission completion flag, write 1 to clear zero</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>	
          </fields>
        </register>			
		
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>PSRAM Interrupt Error Enable Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AEIEN</name>
              <description>Address error interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CENEIEN</name>
              <description>CEM error interrupt marker enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMATEN</name>
              <description>DMA bus transmission completion enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>	
          </fields>
        </register>			
	
        <register>
          <name>STATUS</name>
          <displayName>STATUS</displayName>
          <description>PSRAM controller state machine register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSRAM_STATE</name>
              <description>PSRAM controller state machine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>	
          </fields>
        </register>	
	
        <register>
          <name>CECFG</name>
          <displayName>CECFG</displayName>
          <description>PSRAM CE Pulse Configuration Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x000004B0</resetValue>
          <fields>
            <field>
              <name>CEPWEN</name>
              <description>CE pulse width detection enables</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CELPD</name>
              <description>Maximum duration of CE low pulse 
			  (excluding withdrawal of half sleep):
				T= N*PSRAM clock period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>	
          </fields>
        </register>			
		
        <register>
          <name>LATENCY</name>
          <displayName>LATENCY</displayName>
          <description>PSRAM Read/Write Delay Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00050505</resetValue>
          <fields>
            <field>
              <name>RLATENCY</name>
              <description>Read the delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WLATENCY</name>
              <description>Write the delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>	
          </fields>
        </register>		
      </registers>	
  	</peripheral>		
	
  	</peripherals>	
	</device>